Repository: Happy-Ferret/webpg-firefox
Catalog: po/*.po
Languages: ar

source: About WebPG
ar: حول WebPG

source: Platform
ar: منصة

source: Product
ar: المنتج

source: User Agent
ar: عميل المستخدم

source: Language
ar: للغة

source: GnuPG binary
ar: GnuPG قابل للتنفيذ

source: GnuPG home directory
ar: GnuPG الدليل الرئيسي

source: Finished
ar: منتهي

source: WebPG Plugin failed to load
ar: WebPG فشل تحميل البرنامج المساعد

source: Key Generation Complete
ar: أكملت إنشاء المفتاح

source: Key Generation
ar: مفتاح الجيل

source: Open Key Manager
ar: فتح إدارة المفاتيح

source: WebPG Key Generation Failed
ar: WebPG الجيل مفتاح فشل

source: The generation of your new key is now complete
ar: توليد المفتاح الخاص بك هو الآن كاملة

source: Select Recipient(s)
ar: حدد المستلمين

source: Import
ar: استورد

source: Search/Filter
ar: بحث / فلتر

source: Encrypt
ar: تشفير

source: Cancel
ar: إلغاء

source: UIDs
ar: مستخدم المعرفات

source: Error loading WebPG
ar: خطأ في تحميل WebPG

source: We encountered a problem while attempting to load WebPG
ar: واجهنا مشكلة أثناء محاولة تحميل WebPG

source: Error
ar: خطأ

source: Suggestions
ar: اقتراحات

source: The plugin was unable to load
ar: كان غير قادر على تحميل البرنامج المساعد

source: There might be a problem with the gpg installation
ar: قد يكون هناك مشكلة في التثبيت GPG

source: consider reinstalling gpg4win
ar: النظر في إعادة تثبيت gpg4win

source: Error Details
ar: تفاصيل الخطأ

source: Error in Method
ar: خطأ في الأسلوب

source: Error Code
ar: رمز الخطأ

source: Error String
ar: خطأ سلسلة

source: File
ar: ملف

source: Line
ar: السطر

source: Unknown Error
ar: خطأ مجهول

source: System Information
ar: معلومات النظام

source: App Version
ar: التطبيق الإصدار

source: Sub-product
ar: المنتج الفرعي

source: Vendor
ar: المُنتِج

source: You do not have any keys for
ar: لم يكن لديك أي مفاتيح

source: or
ar: أو

source: You have more than 1 public key matching that address
ar: لديك أكثر من 1 المفتاح العمومي مطابقة هذا العنوان

source: The Key for
ar: مفتاح لل

source: is invalid
ar: غير صالح

source: Open the Key Manager
ar: فتح إدارة المفاتيح

source: Sign only
ar: توقيع فقط

source: Sign and Encrypt
ar: توقيع وتشفير

source: Symmetric Encryption
ar: متماثل التشفير

source: Do not use WebPG for this message
ar: لا تستخدم WebPG لهذه الرسالة

source: Key Manager
ar: مفتاح مدير

source: Options
ar: خيارات

source: PGP ENCRYPTED OR SIGNED MESSAGE
ar: رسالة مشفرة PGP أو وقعت

source: WebPG Key Manager
ar: مفتاح مدير WebPG

source: Private Keys
ar: مفاتيح خاصة

source: Public Keys
ar: مفاتيح العامة

source: Your Name
ar: اسمك

source: Your Email
ar: البريد الإلكتروني الخاص بك

source: Comment
ar: التعليق

source: Passphrase
ar: عبارة المرور

source: Repeat Passphrase
ar: تكرار عبارة المرور

source: Advanced Options
ar: خيارات متقدمة

source: Public Key Algorithm
ar: مفتاح خوارزمية العامة

source: Public Key Size
ar: مفتاح الحجم العام

source: Private Key Algorithm
ar: مفتاح خوارزمية خاصة

source: Private Key Size
ar: مفتاح الحجم خاصة

source: Expire in
ar: تنتهي في

source: Never
ar: أبدا

source: n30 days
ar: 30 يوما

source: n90 days
ar: 90 يوما

source: n1 year
ar: 1 سنة

source: Subkey Options
ar: خيارات للمفتاح الفرعي

source: encrypt only
ar: التشفير فقط

source: set your own capabilities
ar: تعيين القدرات الخاصة بك

source: Sign
ar: توقيع فقط

source: Authenticate
ar: مصادقة

source: Revoke this Key
ar: إلغاء هذا مفتاح

source: Revoke this UID
ar: إلغاء هذا المستخدم معرف

source: Revoke this Signature
ar: إلغاء هذا التوقيع

source: Delete this Signature
ar: حذف هذا التوقيع

source: Delete this UID
ar: حذف هذا معرف المستخدم

source: Delete this Key
ar: حذف هذا المفتاح

source: This key will be permanently deleted
ar: سيتم حذف هذا المفتاح بشكل دائم

source: Are you sure
ar: هل أنت متأكد

source: Change Expiration
ar: تاريخ انتهاء الصلاحية الجديد

source: Sign this UID
ar: التوقيع على هذه هوية المستخدم

source: Key Details
ar: مفتاح التفاصيل

source: Export Public Key
ar: تصدير للمفتاح العام

source: Add UID
ar: إضافة المستخدم معرف

source: Are you sure you wish to revoke this Key
ar: هل أنت متأكد أنك ترغب في الغاء هذا معرف المستخدم

source: Are you sure you wish to revoke this UID
ar: هل أنت متأكد أنك ترغب في الغاء هذا التحديد المستخدم

source: Are you sure you wish to revoke this Signature
ar: هل أنت متأكد أنك ترغب في إلغاء هذا التوقيع

source: Are you sure you wish to delete this Signature
ar: هل أنت متأكد أنك تريد حذف هذا التوقيع

source: Are you sure you want to permanently delete this UID
ar: هل أنت متأكد أنك تريد حذف هذا معرف المستخدم بشكل دائم

source: New Expiration Date
ar: تاريخ انتهاء الصلاحية الجديد

source: Never Expire
ar: أبدا انتهاء

source: Expiration Date
ar: تاريخ انتهاء الصلاحية

source: Click to generate a new key
ar: انقر لإنشاء مفتاح جديد

source: Click to enable key
ar: انقر فوق لتمكين مفتاح

source: Click to set default key
ar: انقر لتحديد المفتاح الافتراضي

source: Generating Key
ar: توليد المفتاح

source: Waiting for entropy
ar: في انتظار بايت أكثر عشوائية

source: Building key
ar: توليد المفتاح

source: please wait
ar: يرجى الانتظار

source: Close
ar: غلق

source: trust
ar: الثقة

source: Generate New Key
ar: إنشاء مفتاح جديد

source: Create
ar: خلق

source: Name Required
ar: الاسم مطلوب

source: UID Names must be at least 5 characters
ar: يجب أن تكون هوية المستخدم لا يقل عن 5 أحرف

source: UID Names cannot begin with a number
ar: يمكن الأسماء هوية المستخدم لم يبدأ مع عدد

source: Not a valid email address
ar: لا عنوان بريد إلكتروني صالح

source: Passphrases do not match
ar: كلمات المرور لا تتطابق

source: Building key, please wait
ar: إنشاء المفتاح، يرجى الانتظار

source: This may take a long time (5 minutes or more) to complete
ar: وهذا قد يستغرق وقتا طويلا (5 دقائق أو أكثر) لإكمال

source: Please be patient while the key is created
ar: يرجى أن يكون المريض في حين يتم إنشاء مفتاح

source: It is safe to close this window
ar: أنها آمنة لإغلاق هذه النافذة

source: key generation will continue in the background
ar: وسوف يستمر إنشاء المفتاح في الخلفية

source: Enabled
ar: تمكين

source: Disabled
ar: مشلول

source: Valid
ar: صالح

source: Expired
ar: انقضاء

source: Invalid
ar: غير صالح

source: Revoked
ar: سحب

source: no email address provided
ar: لم يقدم أي عنوان بريد إلكتروني

source: Cannot unset your default key
ar: هذا هو المفتاح الخاص بك الافتراضي

source: Trust Assignment
ar: تعيين الثقة

source: Unknown
ar: غير معروف

source: Marginal
ar: هامشي

source: Full
ar: تماما

source: Ultimate
ar: نهائي

source: Change Passphrase
ar: تغيير عبارة المرور

source: Add Subkey
ar: إضافة مفتاح الفرعي

source: Enable this Key
ar: تمكين هذا المفتاح لتوقيع

source: Disable this Key
ar: حذف هذا المفتاح

source: KeyID
ar: مفتاح معرف

source: Key Created
ar: تم إنشاؤها على

source: Expires
ar: انقضاء

source: Fingerprint
ar: بصمة

source: Status
ar: حالة

source: Key Algorithm
ar: مفتاح خوارزمية

source: Validity
ar: صحة

source: Key Options
ar: خيارات

source: Operations
ar: خيارات

source: Export this Key
ar: استيراد هذا المفتاح

source: Subkeys
ar: المفاتيح الفرعية

source: Subkey Details
ar: مفتاح الفرعي التفاصيل

source: Flags
ar: الأعلام

source: Delete this Subkey
ar: حذف هذا المفتاح

source: Revoke this Subkey
ar: حذف هذا المفتاح

source: User IDs
ar: مستخدم المعرفات

source: Make primary
ar: جعل الابتدائية

source: Revoke UID
ar: سحب

source: REVOKED
ar: فاسخ

source: Created
ar: تم إنشاؤها على

source: self-signature
ar: حذف هذا التوقيع

source: local
ar: محلي

source: non-exportable
ar: غير القابلة للتصدير

source: other signature
ar: حذف هذا التوقيع

source: Revoke
ar: سحب

source: Delete
ar: حذف

source: Signatures made with keys not in your keyring are omitted
ar: لا يتم عرض التواقيع التي تم إنشاؤها باستخدام مفاتيح ليس في كيرينغ الخاص

source: Save
ar: حفظ

source: Delete this key
ar: حذف هذا المفتاح

source: Copy
ar: نسخ

source: Please specify the revocation details
ar: يرجى تحديد تفاصيل من إبطال

source: Reason
ar: سبب

source: No reason specified
ar: لا يوجد سبب محدد

source: Key has been compromised
ar: تم اختراق المفتاح

source: Key is superseded
ar: وقد تم استبدال مفتاح

source: Key is no longer used
ar: لم يعد يستخدم مفتاح

source: Description
ar: وصف

source: User ID is no longer valid
ar: هوية المستخدم لم يعد صالحا

source: Please select which of your keys to create the signature with
ar: الرجاء اختيار أي من المفاتيح الخاصة بك لإنشاء التوقيع مع

source: You have not enabled any keys for use with webpg
ar: لديك لم يتم تمكين أي مفاتيح للاستخدام مع webpg

source: please click here
ar: الرجاء الضغط هنا

source: and select 1 or more keys for use with webpg
ar: وحدد 1 أو أكثر مفاتيح للاستخدام مع webpg

source: You have not generated any keys
ar: لديك لم يتم إنشاء أية مفاتيح

source: and generate a key to use with webpg
ar: وإنشاء مفتاح لاستخدامه مع WebPG

source: Already signed with this key
ar: وقعت بالفعل مع هذا المفتاح

source: Signature added using this key
ar: إنشاء التوقيع باستخدام هذا المفتاح

source: Cannot create signatures without gpgconf utility installed
ar: لا يمكن إنشاء التواقيع دون تثبيت gpgconf

source: Cannot sign a revoked UID
ar: غير قادر على التوقيع من قبل المستخدم المعرف الذي تم إبطال

source: Cannot make a revoked UID primary
ar: لا يمكنك تعيين معرف من المستخدم كما الأولية إذا كان المستخدم معرف تم إبطال

source: Cannot sign an expired key
ar: لا يمكن التوقيع على مفتاح منتهية الصلاحية

source: Are you certain you would like to delete signature
ar: أنت متأكد من أنك تريد حذف التوقيع

source: from this User ID
ar: من هذا المعرف المستخدم

source: This signature was made with a key that does not belong to you
ar: وجاء هذا التوقيع مع مفتاح لا ينتمي لك

source: This action cannot be undone
ar: لا يمكن التراجع عن هذا الإجراء

source: Enable this key for signing
ar: تمكين هذا المفتاح لتوقيع

source: This is your default key
ar: هذا هو المفتاح الخاص بك الافتراضي

source: Make this the default key for encryption operations
ar: جعل هذا المفتاح الافتراضي لعمليات التشفير

source: Searching for
ar: العثور على مفتاح

source: WebPG Options
ar: خيارات WebPG

source: The WebPG NPAPI Plugin is valid
ar: البرنامج المساعد NPAPI WebPG صالحة

source: It appears you have a key-agent configured
ar: يبدو لديك مفتاح وكيل تكوينه

source: gpgconf was detected
ar: تم الكشف عن gpgconf

source: you can use the signature methods
ar: يمكنك استخدام أساليب التوقيع

source: You do not appear to have a key-agent configured
ar: لا يبدو أن لديك مفتاح وكيل تكوينه

source: A working key-agent is required
ar: يجب على مفتاح صالح وكيل تكون موجودة

source: gpgconf does not appear to be installed
ar: gpgconf لا يظهر ليتم تثبيتها

source: You will not be able to create signatures
ar: فلن تكون قادرا على إنشاء التوقيعات

source: There was a problem loading the plugin
ar: هناك مشكلة تهيئة البرنامج المساعد

source: the plugin might be incompatibly compiled for this architechture
ar: قد تجميع البرنامج المساعد لا يكون للهندسة المعمارية الخاصة بك

source: click here for help resolving this issue
ar: انقر هنا للحصول على المساعدة لحل هذه المشكلة

source: Enable Inline formatting of PGP Messages and Keys
ar: تمكين التنسيق التلقائي للرسائل ومفاتيح

source: Always encrypt to your default key in addition to the recipient
ar: تشفير المفتاح دائما الافتراضي الخاص بك بالإضافة إلى المستلم

source: Enable WebPG GMAIL integration
ar: تمكين GMAIL التكامل

source: EXPERIMENTAL
ar: تجريبي

source: Sign outgoing messages in GMAIL
ar: توقيع الرسائل الصادرة في GMAIL

source: Your system appears to be configured correctly for WebPG
ar: النظام الخاص بك ويبدو أن تكوين بشكل صحيح ل WebPG

source: There is a problem with your configuration
ar: هناك مشكلة مع التكوين الخاص بك

source: WebPG GMAIL integration is EXPERIMENTAL
ar: جوجل التكامل تجريبية WebPG

source: use at your own risk
ar: استخدام على مسؤوليتك الخاصة

source: Text copied to clipboard
ar: تم نسخ النص إلى الحافظة

source: There may have been a problem placing the data into the clipboard
ar: قد كانت هناك مشكلة وضع البيانات في الحافظة

source: COPY TO CLIPBOARD
ar: نسخ إلى الحافظة

source: Paste Public Key
ar: لصق المفتاح العمومي

source: Clear-sign this text
ar: واضحة توقيع هذه الرسالة

source: Import this Key
ar: استيراد هذا المفتاح

source: Encrypt this text
ar: تشفير هذه الرسالة

source: Decrypt this text
ar: فك تشفير هذا النص

source: Verify this text
ar: التحقق من هذه الرسالة

source: UNABLE TO DECRYPT OR VERIFY THIS MESSAGE
ar: غير قادر على فك تشفير هذه الرسالة أو التحقق

source: PGP ENCRYPTED AND SIGNED MESSAGE
ar: PGP رسالة المشفرة والموقعة

source: DECRYPTION FAILED
ar: فشل فك التشفير

source: NO SECRET KEY
ar: لا المفتاح السري

source: BAD PASSPHRASE
ar: عبارة المرور خاطئة

source: DECRYPT THIS MESSAGE
ar: فك تشفير هذه الرسالة

source: DISPLAY ORIGINAL
ar: عرض الأصلية

source: DETACHED PGP SIGNATURE
ar: التوقيع منفصلة

source: PGP SIGNED MESSAGE
ar: وقعت رسالة PGP

source: THE SIGNATURE ON THIS MESSAGE IS INVALID
ar: التوقيع غير صالح

source: THE SIGNATURE MIGHT BE TAMPERED WITH
ar: تم تغيير التوقيع

source: THIS MESSAGE WAS SIGNED WITH KEY
ar: وقد وقع هذه الرسالة مع المفتاح

source: THIS MESSAGE WAS SIGNED WITH AN EXPIRED PUBLIC KEY
ar: وقد وقع هذه الرسالة مع المفتاح العمومي الذي انتهت مدة صلاحية

source: THIS MESSAGE WAS SIGNED WITH A PUBLIC KEY NOT IN YOUR KEYRING
ar: وقد وقع هذه الرسالة مع مفاتيح العامة التي ليست في الدائري مفتاح

source: THE SIGNATURE ON THIS MESSAGE FAILED
ar: التوقيع على هذه الرسالة غير صالح

source: THE MESSAGE MAY BE TAMPERED WITH
ar: قد يكون العبث بالرسالة

source: PGP PUBLIC KEY
ar: PGP مفاتيح العامة

source: Names/UIDs on Key
ar: أسماء على مفتاح

source: THIS KEY IS NOT IN YOUR KEYRING
ar: هذا المفتاح ليس في كيرينغ الخاص

source: THIS KEY IS IN YOUR KEYRING
ar: هذا المفتاح هو في كيرينغ الخاص

source: IMPORT THIS KEY
ar: استيراد هذا المفتاح

source: DELETE THIS KEY
ar: حذف هذا المفتاح

source: HIDE ORIGINAL
ar: إخفاء الأصلي

source: UNUSABLE KEY
ar: غير صالحة للاستعمال مفتاح

source: NO USER ID
ar: مفقود هوية المستخدم
